Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: The new title for the window.
ja: ウィンドウの新しいタイトル。

source: The new usage is shown below:
ja: 新しい使い方は以下の通りです：

source: The new width and height of Control (in pixels).
ja: Controlの新しい幅と高さ（ピクセル単位）です。

source: The new width and height of the window (in pixels).
ja: ウィンドウの新しい幅と高さ（ピクセル単位）。

source: The new width and height of the window's client area, which is the area excluding title bar, menu bar, and borders.
ja: ウィンドウのクライアント領域（タイトルバー、メニューバー、ボーダーを除く領域）の新しい幅と高さを指定します。

source: The newly added item should now exist in the Tools menu.
ja: 新たに追加された項目は、「ツール」メニューに存在するようになります。

source: The newly inserted column starts off with empty contents beneath it unless it is the first column, in which case it inherits the old first column's contents and the old first column acquires blank contents.
ja: 新しく挿入された列は、それが最初の列でない限り、その下に何もない状態で始まり、その場合、古い最初の列の内容を引き継ぎ、古い最初の列は空白の内容を獲得する。

source: The newly started Input is placed on the top of the InputHook stack, which allows it to override any previously started Input.
ja: 新しく開始された入力は、InputHookスタックの最上位に置かれ、以前に開始された入力を上書きすることができます。

source: The note above regarding OS being XP and msg values changing with different OSes is purely cautionary.
ja: OSがXPであること、そしてOSが異なるとmsgの値が変化することに関する上記の注釈は、純粋に注意のためのものである。

source: The notification codes (numbers) can be found in the Windows SDK, or by searching the Internet.
ja: 通知コード（数字）は、Windows SDK、またはインターネットで検索して確認できます。

source: The number doesn't update unless you select "Refresh" from the View menu.
ja: 表示メニューから「更新」を選択しない限り、数値は更新されません。

source: The number of a subpattern, even one that also has a name.
ja: サブパターンの番号で、名前も持っているものでもよい。

source: The number of axes supported by the joystick.
ja: ジョイスティックがサポートしている軸の数です。

source: The number of buttons supported by the joystick (not always accurate).
ja: ジョイスティックがサポートしているボタンの数（必ずしも正確ではありません）。

source: The number of bytes of data to use.
ja: 使用するデータのバイト数を指定します。

source: The number of bytes to allocate.
ja: 割り当てるバイト数を指定します。

source: The number of bytes to write.
ja: 書き込むバイト数を指定します。

source: The number of clicks to send.
ja: 送信するクリック数です。

source: The number of columns depends on the width of the control and the width of the widest text item in it.
ja: 列の数は、コントロールの幅と、その中で最も幅の広いテキストアイテムの幅に依存します。

source: The number of digits before the decimal point depends on the magnitude of the number, and the number of digits after the decimal point depends on the requested precision.
ja: 小数点以下の桁数は数値の大きさに依存し、小数点以下の桁数は要求精度に依存します。

source: The number of icons by which the list will grow each time it exceeds the current list capacity (if omitted, it defaults to 5).
ja: リストが現在のリスト容量を超えるたびに増加するアイコンの数（省略された場合、デフォルトは5）。

source: The number of icons you expect to put into the list immediately (if omitted, it defaults to 2).
ja: すぐにリストに入れることを想定したアイコンの数（省略された場合、デフォルトは2です）。

source: The number of milliseconds that have elapsed since A_PriorHotkey was pressed.
ja: A_PriorHotkeyが押されてから経過したミリ秒数。

source: The number of milliseconds that have elapsed since A_ThisHotkey was pressed.
ja: A_ThisHotkeyが押されてから経過したミリ秒数。

source: The number of milliseconds that have elapsed since the system last received keyboard, mouse, or other input.
ja: システムが最後にキーボードやマウスなどの入力を受け取ってから経過したミリ秒数。

source: The number of milliseconds that have elapsed since the system was started, up to 49.7 days.
ja: システムが起動してから経過したミリ秒数（最大49.7日）。

source: The number of pairs is unlimited.
ja: 組数は無制限です。

source: The number of parameters that Address's caller will pass to it.
ja: Addressの呼び出し元がAddressに渡すパラメータの数。

source: The number of parameters that would be passed to the method or function.
ja: メソッドや関数に渡されるパラメータの数です。

source: The number of seconds to wait before timing out and returning 0.
ja: タイムアウトして0を返すまでの待ち時間を示す秒数です。

source: The number of the column, where the specified row is located.
ja: 指定された行が位置する列の番号。

source: The number of the currently executing line within the script (or one of its #Include files).
ja: スクリプト(またはその#Include files)内で現在実行中の行の番号。

source: The number of the currently focused row.
ja: 現在フォーカスされている行の番号。

source: The number of the message to monitor or query, which should be between 0 and 4294967295 (0xFFFFFFFF).
ja: 監視または問い合わせるメッセージの番号で、0から4294967295（0xFFFFFFF）の間でなければなりません。

source: The number of the row whose text to be retrieved.
ja: テキストを取得する行の番号。

source: The number of the row, whose text to be retrieved.
ja: テキストを取得する行の番号。

source: The number of times to click the mouse.
ja: マウスをクリックする回数を指定します。

source: The number returned from a previous call to IL_Create.
ja: 以前にIL_Createを呼び出した際に返された番号。

source: The number to store.
ja: 保存する番号です。

source: The object also supports enumeration; that is, the for-loop is supported.
ja: また、このオブジェクトは列挙をサポートしています。つまり、forループがサポートされています。

source: The object can be an Array or any other kind of enumerable object (any object with an __Enum method) or an enumerator.
ja: オブジェクトは、Arrayや他の種類の列挙可能なオブジェクト（__Enumメソッドを持つ任意のオブジェクト）、または列挙者であることができます。

source: The object of the control that received the event (blank if none).
ja: イベントを受信したコントロールのオブジェクト（ない場合は空白）。

source: The object of the control upon which the files were dropped (blank if none).
ja: ファイルがドロップされたコントロールのオブジェクト（ない場合は空白）。

source: The object still exists (until the script releases it) but cannot be used.
ja: オブジェクトはまだ（スクリプトがそれを解放するまで）存在しますが、使用することはできません。

source: The object's Size property returns the number of bytes read.
ja: オブジェクトのSizeプロパティは、読み込んだバイト数を返します。

source: The object's __Enum method is called to retrieve an enumerator object.
ja: オブジェクトの__Enumメソッドを呼び出して 列挙者オブジェクトになります。

source: The object's class name.
ja: オブジェクトのクラス名。

source: The offset (in characters) of the second item from the first as seen in the original/unsorted list (see examples).
ja: 元の/ソートされていないリストで見た、最初の項目から2番目の項目のオフセット（文字数）（例を参照）。

source: The old behaviour was to use the label/function by that name if one existed, but only if the Label parameter did not contain a variable reference or expression.
ja: 以前の動作は、ラベル/関数が存在する場合、その名前を使用するものでしたが、Labelパラメータに変数参照や式が含まれていない場合に限り、その名前を使用します。

source: The one-based column number that was clicked.
ja: クリックされた1ベースの列番号です。

source: The only drawback of using A_IconHidden := true at the very top of the script is that the tray icon might be briefly visible when the script is first launched.
ja: スクリプトの一番上でA_IconHidden := trueを使用する唯一の欠点は、スクリプトの初回起動時にトレイアイコンが一瞬表示される可能性があることです。

source: The only exception is that this parameter is omitted when a Gui handles its own events, since this already contains a reference to the Gui.
ja: 唯一の例外は、Guiがそれ自身のイベントを処理するとき、このパラメータは省略されることです。なぜなら、thisはすでにGuiへの参照を含んでいるからです。

source: The only exception is the case-insensitive option of the RegEx mode, e.g. "i)untitled - notepad".
ja: 唯一の例外は、"i)untitled - notepad"のようなRegExモードの大文字小文字を区別しないオプションである。

source: The only modifiers supported are ^ (Control), ! (Alt), and + (Shift).
ja: 対応する修飾語は、^（Control）、！（Alt）および +（Shift）のみです。

source: The only modifiers supported are ^ (Ctrl), ! (Alt), and + (Shift).
ja: 対応する修飾語は、^（Ctrl）、！（Alt）および +（Shift）のみです。

source: The only way to override this special default is to specify an opposing option in each hotstring that has a continuation section (e.g. :t0:text1:: or :r:text2::).
ja: この特別なデフォルトを上書きする唯一の方法は、継続セクションを持つ各ホットストリングで反対側のオプションを指定することです（例えば、:t0:text1:: or :r:text2::など）。

source: The opening brace can also be written on the same line as the hotkey, after ::.
ja: また、冒頭のブレースは、ホットキーと同じ行に、::の後に書くことができます。

source: The opening brace may also be specified on the same line as the double-colon to support the OTB (One True Brace) style.
ja: 左中括弧は、OTB (One True Brace) スタイルをサポートするために、二重コロンと同じ行に指定することもできます。

source: The opening brace of a block can be written at the end of the same line as an If, Else, Loop, While, For, Try, Catch or Finally statement (basically any control flow statement which has a body).
ja: ブロックの開始ブレースは、If、Else、Loop、While、For、Try、Catch、Finally文（基本的にボディを持つあらゆる制御フロー文）と同じ行末に書くことができます。

source: The operating system automatically omits leading and trailing spaces/tabs from the retrieved string.
ja: オペレーティングシステムは、取得した文字列から先頭と末尾のスペース/タブを自動的に省略します。

source: The operating system limits each environment variable to 32 KB of text.
ja: オペレーティングシステムは、各環境変数のテキストを32KBに制限しています。

source: The operating system offers standard dialog boxes that prompt the user to pick a font and/or color, or an icon.
ja: オペレーティングシステムには、フォントや色、アイコンを選択するダイアログボックスが標準装備されています。

source: The operating system provides several different ways to send keys, with different caveats for each.
ja: OSでは、キーを送信する方法がいくつか用意されており、それぞれに注意点があります。

source: The operating system will treat a .URL file created by the above as a real shortcut even though it is a plain text file rather than a .LNK file.
ja: OSは、.LNKファイルではなくプレーンテキストファイルであっても、上記によって作成された.URLファイルを本物のショートカットとして扱います。

source: The operation will continue even if error(s) are encountered.
ja: エラーが発生しても、操作は続行されます。

source: The operation will fail and have no effect if Dest already exists as a file or directory.
ja: Destがすでにファイルまたはディレクトリとして存在する場合、操作は失敗し、何の効果もありません。

source: The operation will fail and have no effect if DestPattern already exists as a file or directory.
ja: DestPatternがすでにファイルまたはディレクトリとして存在する場合、操作は失敗し、何の効果もありません。

source: The operation will fail if Dest already exists as a file or directory.
ja: Destがすでにファイルまたはディレクトリとして存在する場合、操作は失敗します。

source: The operator is expects a class, so x is y checks for y.Prototype in the base object chain.
ja: isオペレーターはクラスを期待するので、x is yは、ベースオブジェクトチェーンでy.Prototypeをチェックします。

source: The operator may appear either before or after the variable's name.
ja: 演算子は変数名の前でも後でもよい。

source: The operators &&, ||, and and or yield whichever value determined the result, similar to JavaScript and Lua.
ja: 演算子&&,||,and および orは、JavaScript や Lua と同様に、結果を決定したいずれかの値を出力します。

source: The operators = and != now compare their operands alphabetically if both are strings, even if they are numeric strings.
ja: 演算子=と!=は、オペランドが文字列の場合はアルファベット順に比較し、数値文字列の場合はアルファベット順に比較するようになりました。

source: The option is also not shown for critical errors, which are designed to terminate the script.
ja: また、スクリプトを終了させるためのクリティカルエラーの場合は、このオプションは表示されません。

source: The options are Iconx, Icon!, Iconi, Mute and/or any numeric value as before.
ja: オプションは、Iconx、Icon！、Iconi、Mute、および以前のように任意の数値です。

source: The options below are all disabled (except on Windows 2000, where the "make new folder" button might appear anyway).
ja: 以下のオプションはすべて無効です（ただし、Windows 2000では、「新しいフォルダの作成」ボタンが表示される場合があります）。

source: The options only affect translation of line endings within the text returned by File.Read or written by File.Write or File.WriteLine.
ja: このオプションは、File.Readによって返されたテキスト、File.WriteまたはFile.WriteLineによって書き込まれたテキスト内の行末の変換にのみ影響します。

source: The order in which hotstrings are defined determines their precedence with respect to each other.
ja: ホットストリングの定義順は、互いの優先順位を決定します。

source: The order of navigation is determined by the order in which the controls were originally added.
ja: ナビゲーションの順序は、コントロールが最初に追加された順序によって決定されます。

source: The order of the coordinate pairs with respect to each other is sometimes important.
ja: 互いに対する座標ペアの順番が重要な場合もある。

source: The original reasons for adding them were superseded by other changes, such as the Map type, changes to how meta-functions work, and DefineProp itself superseding meta-functions for some purposes.
ja: Mapタイプ、メタファンクションの動作方法の変更、DefineProp自体がメタファンクションに取って代わるなど、当初追加した理由は他の変更に取って代わられた。

source: The other bits are reserved for future use.
ja: 他のビットは将来の使用のために予約されている。

source: The other comparison operators only "see" up to the first binary zero.
ja: 他の比較演算子は、最初の2進数のゼロまでしか「見えない」のです。

source: The other modifiers are:
ja: その他のモディファイアは：

source: The other parameters can be used to override the settings last saved in the GUI.
ja: その他のパラメーターは、GUIで最後に保存した設定を上書きするために使用できる。

source: The outer function must refer to the variable in at least one of the following ways:
ja: 外側の関数は、次のうち少なくとも1つの方法で変数を参照する必要があります：

source: The outermost set of single or double quote marks is also omitted, but any spaces inside the quote marks are preserved.
ja: 最も外側にあるシングルクォートまたはダブルクォートのセットも省略されるが、クォートマーク内のスペースは保持されました。

source: The output value (if any) of numeric parameters with the * or P suffix is ignored if the script passes a plain variable containing a number.
ja: スクリプトが数値を含むプレーンな変数を渡す場合、接尾辞に * または P を持つ数値パラメーターの出力値（もしあれば）は無視されます。

source: The output variable in which to store the thrown value, which is typically an Error object.
ja: 投げられた値を格納する出力変数で、通常はErrorオブジェクトです。

source: The owner window can paint items in report view in response to WM_DRAWITEM messages (not directly supported by AutoHotkey).
ja: オーナーウィンドウは、WM_DRAWITEMメッセージに応答してレポートビューのアイテムをペイントすることができます（AutoHotkeyでは直接サポートされていません）。

source: The p2 and p3 parameters will be used as literals in the 2nd and 3rd parameters of a RegExReplace function to manipulate the value returned.
ja: p2 と p3 パラメータは、RegExReplace関数の 2 番目と 3 番目のパラメータでリテラルとして使用され、返される値を操作します。

source: The parameter count passed to __Enum is 0 if there are no variables or commas; otherwise it is 1 plus the number of commas present.
ja: Enumに渡されるパラメータカウントは、変数やカンマがない場合は0、ない場合は1にカンマの数を加えたものになります。

source: The parameter list can optionally be enclosed in parentheses.
ja: パラメータリストは、オプションで括弧で囲むことができます。

source: The parameter list may optionally be enclosed in parentheses, in which case the space or tab after Catch is optional.
ja: パラメータリストは、オプションで括弧で囲むことができ、その場合、Catchの後のスペースまたはタブはオプションです。

source: The parameter list may optionally be enclosed in parentheses, in which case the space or tab after catch is optional.
ja: パラメータリストは、オプションで括弧で囲むことができ、その場合、catchの後のスペースまたはタブはオプションです。

source: The parameter name can be changed by using a named function.
ja: パラメータ名は、名前付き関数を使用することで変更することができます。

source: The parameters could already be specified in any order, but now specifying only the first parameter defaults the other bound to 0 instead of 2147483647.
ja: パラメータはすでに任意の順序で指定することができましたが、最初のパラメータだけを指定すると、他のバウンドが2147483647ではなく0にデフォルト設定されるようになりました。

source: The parameters directly correspond to properties described above, but may differ for Error subclasses which override the __New method.
ja: パラメータは上記のプロパティに直接対応しますが、__NewメソッドをオーバーライドするErrorサブクラスでは異なる場合があります。

source: The parameters support any kind of expression; this means for example:
ja: パラメータはあらゆる種類の表現に対応している：

source: The parent item to check.
ja: チェックする親アイテム。

source: The parent window is responsible for drawing tabs.
ja: 親ウィンドウはタブの描画を担当する。

source: The parentheses are usually only necessary if the return value of the function is needed or the function name is not written at the start of the line.
ja: 括弧が必要なのは、関数の戻り値が必要な場合か、関数名が行頭に書かれていない場合だけである。

source: The parentheses can be omitted in specific cases; see Function Call Statements.
ja: 特定の場合、括弧を省略することができます。「関数呼び出しステートメント」を参照してください。

source: The part number of the clicked section (however, the part number might be a very large integer if the user clicks near the sizing grip at the right side of the bar).
ja: クリックした部分の品番（ただし、バー右側のサイズグリップ付近をクリックした場合、品番は非常に大きな整数になる可能性があります）。

source: The part of Haystack to the right of the last replacement is left unchanged.
ja: ヘイスタックの右側はそのまま。

source: The path and name of the file/folder currently retrieved.
ja: 現在取得しているファイル/フォルダのパスと名前。

source: The path and name of the script to compile.
ja: コンパイルするスクリプトのパスと名前。

source: The path of a file or directory as explained below.
ja: 以下に説明するファイルまたはディレクトリのパスです。

source: The path of an icon or image file.
ja: アイコンや画像ファイルのパス。

source: The path of the directory in which A_LoopFileName resides.
ja: A_LoopFileNameが存在するディレクトリのパス。

source: The path of the file to open, which is assumed to be in A_WorkingDir if an absolute path isn't specified.
ja: 開くファイルのパス。絶対パスが指定されていない場合は、A_WorkingDirにあると仮定されます。

source: The path of the interpreter EXE that would be used, if one was found.
ja: インタープリターEXEが見つかった場合に使用するパス。

source: The path, filename, or file pattern to check.
ja: チェックするパス、ファイル名、またはファイルパターンを指定します。

source: The path, folder name, or file pattern to check.
ja: チェックするパス、フォルダ名、またはファイルパターンを指定します。

source: The path\name of AutoHotkey.exe to be used as a utility when compiling the script.
ja: スクリプトのコンパイル時にユーティリティとして使用するAutoHotkey.exeのパス名。

# The path ame of the output .exe to be created.
source: The path\name of the output .exe to be created.
ja: 作成される出力.exeのパス名。

source: The paths are compared with lstrcmpi after expansion with GetFullPathName.
ja: パスはGetFullPathNameで展開した後、lstrcmpiで比較されます。

source: The pattern to search for, which is a Perl-compatible regular expression (PCRE).
ja: 検索するパターンで、Perl互換正規表現（PCRE）です。

source: The pattern's options (if any) must be included at the beginning of the string followed by a close-parenthesis.
ja: パターンのオプションがある場合は、文字列の先頭に含める必要があり、その後に閉じ括弧が続きます。

source: The period (.) is not included.
ja: ピリオド（.）は含まれません。

source: The phrase "AHK_DEFAULT" no longer has any special meaning.
ja: 「AHK_DEFAULT」というフレーズは、もはや特別な意味を持ちません。

source: The physical end of the script also acts as Exit.
ja: スクリプトの物理的な端は、Exitとしても機能します。

source: The physical state of a key or mouse button will usually be the same as the logical state unless the keyboard and/or mouse hooks are installed, in which case it will accurately reflect whether or not the user is physically holding down the key or button (as long as it was pressed down while the script was running).
ja: キーボードやマウスのボタンの物理的な状態は、キーボードやマウスのフックがインストールされていない限り、論理的な状態と同じになるのが普通で、その場合、ユーザーが物理的にキーやボタンを押し続けているかどうかを正確に反映します（スクリプトの実行中に押し続けている限りは）。

source: The physical state of a key or mouse button will usually be the same as the logical state unless the keyboard and/or mouse hooks are installed, in which case it will accurately reflect whether or not the user is physically holding down the key.
ja: キーボードやマウスのボタンの物理的な状態は、キーボードやマウスのフックが設置されていない限り、通常は論理的な状態と同じであり、その場合、ユーザーが物理的にキーを押しているかどうかが正確に反映されます。

source: The physical state of the modifier keys can be tracked reliably, which removes the need for A_HotkeyModifierTimeout and may improve the reliability with which Send restores the modifier keys to their proper states after temporarily releasing them.
ja: 修飾キーの物理的な状態を確実に追跡できるため、A_HotkeyModifierTimeoutの必要性がなくなり、一時的に解放した後にSendが修飾キーを適切な状態に復元する信頼性が向上する可能性があります。

source: The piecemeal construction of a continuation section by means of #Include is not supported.
ja: Includeによる継続セクションの断片的な構築はサポートされていない。

source: The pixel must be visible; in other words, it is not possible to retrieve the pixel color of a window hidden behind another window.
ja: つまり、他のウィンドウの後ろに隠れたウィンドウのピクセルカラーを取得することはできません。

source: The plugin has not been updated since 2012, and is not available for Notepad++ 64-bit.
ja: このプラグインは2012年以降更新されておらず、Notepad++の64ビット版には対応していません。

source: The plus sign (+) is optional and can be replaced with minus (-) to remove the option, as in -Radio.
ja: プラス記号（+）はオプションで、-Radioのようにマイナス記号（-）に置き換えてオプションを解除することができます。

source: The point-of-view (hat) control.
ja: 視点（ハット）コントロールです。

source: The pointer value can be passed directly or encapsulated within an object with the Ptr property, such as a ComValue with variant type VT_UNKNOWN.
ja: ポインタ値は直接渡すか、バリアントタイプVT_UNKNOWNを持つComValueなど、Ptrプロパティを持つオブジェクト内にカプセル化することができます。

source: The position and size of the client area are less dependent on OS version and theme than the values returned by Gui.GetPos.
ja: クライアント領域の位置とサイズは、Gui.GetPosが返す値よりもOSのバージョンやテーマに依存しません。

source: The position and size of the client area are less dependent on OS version and theme than the values returned by WinGetPos.
ja: クライアント領域の位置とサイズは、WinGetPosが返す値よりもOSのバージョンやテーマに依存しません。

source: The position is a byte offset from the beginning of the file, where 0 is the first byte.
ja: 位置は、ファイルの先頭からのバイトオフセットで、0が最初のバイトとなります。

source: The position is relative to the GUI window's client area, which is the area not including title bar, menu bar, and borders.
ja: 位置は、GUIウィンドウのクライアント領域（タイトルバー、メニューバー、ボーダーを含まない領域）からの相対位置です。

source: The position of the focused item.
ja: フォーカスされたアイテムの位置。

source: The position to insert Value1 at.
ja: Value1を挿入する位置を指定します。

source: The possible values are defined by the system; they include (but are not limited to) the following:
ja: 取り得る値はシステムによって定義され、以下のようなものがあります（ただし、これらに限定されません）：

source: The possible values are defined by the system; they include (but are not limited to) the following: NTFS, FAT32, FAT, CDFS (typically indicates a CD), or UDF (typically indicates a DVD).
ja: 取り得る値はシステムによって定義され、以下のようなものがあります（ただし、これらに限定されません）：はNTFS、FAT32、FAT、CDFS（通常はCDです）、UDF（通常DVDです）。

source: The potential base object to test.
ja: テストするベースオブジェクトの候補です。

source: The pound sign [#] stands for Win, which is known as a modifier key:
ja: ポンド記号[#]はWinの略で、修飾キーと呼ばれるものです：

source: The power operator is right-associative.
ja: 冪演算子は右結合である。

source: The precedence of the assignment operators is automatically raised when it would avoid a syntax error or provide more intuitive behavior.
ja: 代入演算子の優先順位は、構文エラーを回避したり、より直感的な動作を提供したりする場合に、自動的に引き上げられる。

source: The precise terms and conditions for copying, distribution and modification follow.
ja: 複製、頒布、改変に関する正確な条件は以下の通りです。

source: The precision specifies the number of digits after the point.
ja: 精度は、ポイント以降の桁数を指定します。

source: The preferred method is #HotIf.
ja: 好ましいのは「#HotIf」です。

source: The prefix key loses its native function, unless it is a standard modifier key or toggleable key such as CapsLock.
ja: プレフィックスキーは、標準的な修飾キーやCapsLockのようなトグル可能なキーでない限り、本来の機能を失います。

source: The presence of #Hotstring NoMouse anywhere in the script affects all hotstrings, not just those physically beneath it.
ja: スクリプトのどこかに#Hotstring NoMouseがあると、物理的にその下にあるものだけでなく、すべてのホットストリングに影響します。

source: The presence of AltGr on each keyboard layout is now always detected by reading the KLLF_ALTGR flag from the keyboard layout DLL.
ja: キーボードレイアウトDLLからKLLF_ALTGRフラグを読み取ることで、各キーボードレイアウトにAltGrがあるかどうかを常に検出するようにしました。

source: The presence of a continuation section also causes the hotstring to default to Text mode.
ja: また、継続セクションがあると、ホットストリングのデフォルトがテキストモードになります。

source: The presence of multiple characters indicates that a dead key was used prior to the last keypress, but the two keys could not be transliterated to a single character.
ja: 複数の文字が存在することは、最後のキー押下の前にデッドキーが使用されていたことを示しますが、2つのキーは1つの文字に変換することができませんでした。

source: The presence of this error may also indicate that an exception occurred.
ja: このエラーの存在は、例外が発生したことを示す場合もあります。

source: The previous value of MyObject[AnyKey] will be stored in RemovedValue.
ja: MyObject[AnyKey]の前の値がRemovedValueに格納されます。

source: The previously playing audio or video is now paused.
ja: それまで再生していた音声や動画が一時停止されています。

source: The process can be simplified by utilizing this function.
ja: この機能を利用することで、プロセスを簡略化することができる。

source: The process exit code can be used to detect this condition; if there is a syntax error, the exit code is 2.
ja: シンタックス・エラーの場合、終了コードは2である。

source: The process exit code is zero if the script successfully loaded, or non-zero if there was an error.
ja: プロセスの終了コードは、スクリプトのロードに成功した場合は0、エラーが発生した場合は0以外となる。

source: The process identifier (PID) is typically retrieved by WinGetPID, Run or Process functions.
ja: プロセス識別子（PID）は通常、WinGetPID、RunまたはProcess関数で取得される。

source: The process of enumeration is as follows:
ja: 列挙の流れは以下の通りです：

source: The process of finding out the value of an expression is called evaluation.
ja: 式の値を求める作業を評価といいます。

source: The program is designed to support at least several million variables without a significant drop in performance.
ja: このプログラムは、パフォーマンスを大きく落とすことなく、少なくとも数百万の変数をサポートするように設計されている。

source: The program loads the script into memory line by line.
ja: プログラムはスクリプトを一行ずつメモリにロードする。

source: The program may automatically load script code from the following resources, if present in the file:
ja: ファイル内にスクリプトコードが存在する場合、プログラムは自動的に以下のリソースからスクリプトコードをロードすることができる：

source: The program to execute, plus parameters.
ja: 実行するプログラムとパラメータ。

source: The program will exit.
ja: プログラムが終了します。
